export const METADATA = {
  default: 'پایش من | مراقب سلامتی من',
  template: '%s | پایش من',
  description: 'پلتفرم ارائه خدمات آموزشی به افراد تحت درمان',
  openGraph: {
    url: 'https://payeshman.com',
    siteName: 'Payeshman'
  }
}

export const BRAND_NAME = {
  fa: 'پایش من',
  en: 'Payeshman'
}
export const BRAND_CAPTION = 'اپلیکیشن تخصصی آموزش خودمراقبتی به بیماران'
export const BRAND_DESCRIPTION = `اپلیکیشن پایش من با ارائه آموزش های علمی طبقه بندی شده، هدفمند و فرد
            محور، به بیماران کمک می کند تا در دوران بهبودی بتوانند از خودشان
            مراقبت کنند. بیماران و همراهان ایشان می توانند با استفاده از
            اپلیکیشن پایش من تمام آموزش ها و نکات لازم را در زمینه مراقبت ها،
            تغذیه، ورزش، فعالیت ها، مهارت ها و داروها متناسب با شرایط و وضعیت
            بالینیشان دریافت نمایند.`
