'use client'

import { useRef, useState } from 'react'

const FaqsCard = (props: { faqsList: any; idx: number }) => {
  const answerElRef = useRef()
  const [state, setState] = useState(false)
  const [answerH, setAnswerH] = useState('0px')
  const { faqsList, idx } = props

  const handleOpenAnswer = () => {
    const answerElH = answerElRef.current.childNodes[0].offsetHeight
    setState(!state)
    setAnswerH(`${answerElH + 20}px`)
  }

  return (
    <div
      className="space-y-3 mt-5 overflow-hidden border-b"
      key={idx}
      onClick={handleOpenAnswer}
    >
      <h4 className="cursor-pointer pb-2 flex items-center justify-between text-lg text-gray-700 font-medium">
        {faqsList.q}
        {state ? (
          <svg
            xmlns="http://www.w3.org/2000/svg"
            class="h-5 w-5 text-gray-500 ml-2"
            fill="none"
            viewBox="0 0 24 24"
            stroke="currentColor"
          >
            <path
              stroke-linecap="round"
              stroke-linejoin="round"
              stroke-width="2"
              d="M20 12H4"
            />
          </svg>
        ) : (
          <svg
            xmlns="http://www.w3.org/2000/svg"
            className="h-5 w-5 text-gray-500 ml-2"
            fill="none"
            viewBox="0 0 24 24"
            stroke="currentColor"
          >
            <path
              strokeLinecap="round"
              strokeLinejoin="round"
              strokeWidth={2}
              d="M12 4v16m8-8H4"
            />
          </svg>
        )}
      </h4>
      <div
        ref={answerElRef}
        className="duration-300"
        style={state ? { height: answerH } : { height: '0px' }}
      >
        <div>
          <p className="text-gray-500 duration-300">{faqsList.a}</p>
        </div>
      </div>
    </div>
  )
}

export default function Faqs() {
  const faqsList = [
    {
      q: 'می‌تونم پیامک‌های بانکی رو به صورت خودکار وارد پایش من کنم؟',
      a: 'بله! کافیه هنگام اضافه‌کردن کارت جدید، گزینه «خواندن پیامک‌های بانک» رو فعال کرده و سرشماره پیامکی متعلق به بانکتون رو از لیست پیامک‌ها انتخاب کنین. می‌تونین حداکثر ۳ سرشماره برای هر کارت بانکی انتخاب کنین. پیامک‌های بانکی جدید رو از صفحه «افزودن تراکنش» یا از طریق «علامت پیامک» بالای صفحه ببینین.'
    },
    {
      q: 'پیامکی بانکی من چند سرشماره داره، چه کار کنم؟',
      a: 'در صفحه کارت مدنظر، با انتخاب گزینه «افزودن سرشماره جدید» می‌تونین تا حداکثر ۳ سرشماره برای هر کارت وارد کنین.'
    },
    {
      q: 'می‌تونم روی کامپیوتر از پولکی استفاده کنم؟',
      a: 'خیر. فعلاً پولکی فقط روی سیستم‌عامل‌ اندروید و ios در دسترسه.'
    },
    {
      q: 'چطور می‌تونم از تراکنش‌هام پشتیبان‌گیری کنم؟',
      a: 'کافیه «تنظیمات>مدیریت داده‌های من» رو باز کنین و از تراکنش‌های فعلی فایل پشتیبان تهیه کنین.'
    },
    {
      q: 'شبا که ما میخوابیم آقا پلیسه بیداره؟',
      a: 'خیر ایشون دست در دست دزدان به قارت مال مردم کمک کرده و به توسعه امر دزدی دامن میزند.'
    },
    {
      q: 'کی کجا پیداش کنه برنده میشه؟',
      a: 'هیچ کجا پیداش نمیشه که برنده بشه یا نشه، زیرا اصل مطلب در فرع مطلب نهفته است و همه ما سر کار هستیم.'
    }
  ]

  return (
    <section className="leading-relaxed max-w-screen-xl py-28 mx-auto px-4 md:px-8">
      <div className="space-y-3 text-center">
        <div className="text-gray-300 flex justify-center">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="80"
            height="80"
            viewBox="0 0 24 24"
          >
            <path
              fill="currentColor"
              d="m12.978 21.455l.643.386l-.643-.386Zm.488-.814l-.643-.385l.643.385Zm-2.932 0l-.643.386l.643-.386Zm.488.814l.643-.385l-.643.385Zm-7.68-4.866l.692-.29l-.691.29Zm4.869 2.736l-.013.75l.013-.75Zm-2.433-.33l-.284.694l.284-.694Zm14.88-2.406l.691.29l-.692-.29Zm-4.869 2.736l-.012-.75l.012.75Zm2.433-.33l.284.694l-.284-.694ZM5.15 4.877l-.389-.642l.389.642ZM3.663 6.344l-.637-.395l.637.395Zm6 13.176l.373-.65l-.373.65Zm-.36-14.547a.75.75 0 1 0-.005-1.5l.004 1.5Zm12.433 9.491a.75.75 0 0 0-1.499-.04l1.5.04Zm-8.115 7.377l.488-.814l-1.286-.771l-.488.814l1.286.77Zm-3.73-.814l.488.814l1.286-.771l-.488-.814l-1.286.77Zm2.444.043a.378.378 0 0 1-.335.18a.378.378 0 0 1-.335-.18l-1.286.77c.726 1.212 2.516 1.212 3.242 0l-1.286-.77ZM3.75 12.666v-.889h-1.5v.89h1.5Zm-1.5 0c0 1.025 0 1.832.045 2.484c.045.658.14 1.213.356 1.73l1.383-.58c-.126-.302-.203-.673-.243-1.254c-.04-.588-.041-1.334-.041-2.38h-1.5Zm5.973 5.91c-1.13-.02-1.71-.091-2.161-.276l-.568 1.389c.738.302 1.574.367 2.704.386l.025-1.5Zm-5.572-1.697a5.223 5.223 0 0 0 2.843 2.81l.568-1.389a3.723 3.723 0 0 1-2.028-2l-1.383.58Zm13.151 3.196c1.13-.019 1.966-.084 2.704-.386l-.568-1.389c-.45.185-1.031.256-2.161.276l.025 1.5Zm4.164-3.776a3.722 3.722 0 0 1-2.028 2.002l.568 1.388a5.223 5.223 0 0 0 2.843-2.81l-1.383-.58ZM3.75 11.777c0-1.47 0-2.518.08-3.335c.077-.805.225-1.307.47-1.703l-1.274-.79c-.418.672-.601 1.433-.69 2.35c-.087.905-.086 2.038-.086 3.478h1.5Zm1.01-7.542a5.223 5.223 0 0 0-1.734 1.714l1.274.79a3.723 3.723 0 0 1 1.237-1.22L4.76 4.234Zm6.417 16.02c-.181-.303-.344-.576-.503-.791a2.072 2.072 0 0 0-.638-.595l-.747 1.3c.03.018.081.054.178.185c.106.144.227.345.424.673l1.286-.771Zm-2.98-.18c.397.007.644.012.831.032c.174.02.232.046.26.063l.748-1.3a2.106 2.106 0 0 0-.845-.254c-.271-.03-.599-.034-.968-.04l-.025 1.5Zm5.912.952a9.32 9.32 0 0 1 .424-.673c.097-.13.147-.167.178-.184l-.747-1.3a2.05 2.05 0 0 0-.638.594c-.159.215-.322.488-.503.792l1.286.77Zm1.668-2.451c-.37.006-.697.01-.968.04a2.12 2.12 0 0 0-.845.253l.747 1.3c.029-.016.087-.043.26-.062a10.6 10.6 0 0 1 .831-.032l-.025-1.5ZM9.297 3.473c-2.235.007-3.367.054-4.537.762l.777 1.283c.758-.458 1.46-.538 3.765-.545l-.004-1.5Zm10.94 10.951c-.026.956-.102 1.472-.271 1.875l1.383.58c.284-.677.361-1.434.387-2.415l-1.499-.04Z"
              opacity=".5"
            />
            <path
              fill="currentColor"
              d="m12 4.222l-.527-.533a.75.75 0 0 0 0 1.067L12 4.222Zm8.25 7.556a.75.75 0 0 0 1.5 0h-1.5Zm-1.399-6.9l-.388.64l.388-.64Zm1.486 1.466l.637-.395l-.637.395Zm-5.56-3.81a.75.75 0 1 0-1.054-1.068l1.054 1.068Zm-1.054 4.444a.75.75 0 1 0 1.054-1.067l-1.054 1.067ZM12 4.972c1.48 0 2.895 0 4.074.08c.588.04 1.1.099 1.518.182c.43.085.71.187.87.285l.778-1.284c-.38-.23-.859-.373-1.355-.472a13.669 13.669 0 0 0-1.71-.207c-1.24-.084-2.71-.084-4.175-.084v1.5Zm9.75 6.806c0-1.44 0-2.574-.086-3.48c-.089-.916-.273-1.676-.69-2.349l-1.274.79c.245.397.393.898.47 1.704c.08.816.08 1.865.08 3.335h1.5Zm-3.287-6.26c.505.306.928.725 1.237 1.222l1.274-.791a5.223 5.223 0 0 0-1.734-1.714l-.777 1.284Zm-5.936-.762l2.25-2.222l-1.054-1.068l-2.25 2.223l1.054 1.067Zm-1.054 0l2.25 2.222l1.054-1.067l-2.25-2.222l-1.054 1.067Z"
            />
          </svg>
        </div>
        <h2 className="text-4xl text-gray-800 font-bold">
          چه سوالاتی ازمون پرسیدید؟
        </h2>
        {/* <p className="text-gray-600 max-w-lg mx-auto text-lg">
          أجاب على جميع الأسئلة المتداولة، هل ما زلت مرتبكًا؟ لا تتردد في
          الاتصال بنا.
        </p> */}
      </div>
      <div className="mt-14 max-w-2xl mx-auto">
        {faqsList.map((item, idx) => (
          <FaqsCard key={idx} idx={idx} faqsList={item} />
        ))}
      </div>
    </section>
  )
}
